In [4]:
import pandas as pd

In [5]:
# Series = 1D array 
data = [1,2,3,4,5]
series = pd.Series(data)
print(f'Serries {series}\n')

Serries 0    1
1    2
2    3
3    4
4    5
dtype: int64

In [8]:
# Create a Series from dict 
data = {
    'a': 1,
    'b': 2
}
series_dict = pd.Series(data)
print(type(series_dict))

<class 'pandas.core.series.Series'>

In [11]:
data = [10,20,30]
index = ['a', 'b', 'c']
series = pd.Series (
    data=data,
    index=index
)

print(series.get('a'))

10

In [58]:
data = {
    'Name': ['Kresuh', 'John'],
    'Age': [20, None],
    'City': ['Viet Nam', 'Malaysia']
}
df = pd.DataFrame(
    data=data
)
print(df)

     Name   Age      City
0  Kresuh  20.0  Viet Nam
1    John   NaN  Malaysia

In [28]:
df.iat[0,0]

'Kresuh'

In [30]:
# Data manipulation
# Add column
df['Salary'] = [201516, 216516]
df

     Name  Age       City  Salary
0  Kresuh   20  Viet Name  201516
1    John   30   Malaysia  216516

In [34]:
df.drop('Salary', axis=1, inplace=True)

In [37]:
df

     Name  Age       City
0  Kresuh   21  Viet Name
1    John   31   Malaysia

In [40]:
# Add age to column 
df['Age'] = df['Age'] + 1 
df

     Name  Age      City
0  Kresuh   21  Viet Nam
1    John   31  Malaysia

In [41]:
df.drop(0, inplace=True)

In [42]:
df

   Name  Age      City
1  John   31  Malaysia

In [46]:
df.describe()

             Age
count   2.000000
mean   25.000000
std     7.071068
min    20.000000
25%    22.500000
50%    25.000000
75%    27.500000
max    30.000000

In [50]:
df.tail(2)

     Name  Age      City
0  Kresuh   20  Viet Nam
1    John   30  Malaysia

In [59]:
df.isnull().sum()

Name    0
Age     1
City    0
dtype: int64

In [64]:
df['Fill_AgeNa'] = df['Fill_AgeNa'].apply(lambda x: x * 20)

In [65]:
df

     Name   Age      City  Fill_AgeNa
0  Kresuh  20.0  Viet Nam       400.0
1    John   NaN  Malaysia       400.0